---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBarlengthPrim
source: html/b144af7e-6689-3e6b-b6f7-efab5bc8ace3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinSpanlengthBarlengthPrim Property

"Length (Primary Bar)"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinSpanlengthBarlengthPrim { get; }
```